// news-data.js
const newsData = [
    {
        id: 1,
        title: "كًتب مقررات اللغة الانجليزية لطلاب السنة التحضيرية",
        content: `
            <p>تم الإعلان عن كتب مقررات الإنجليزي في السنة التحضيرية للمستوى الأول والثاني كما هو موضح في الصورة</p>
            <p>تشمل الكتب المقررة:</p>
            <ul>
                <li>UNLOCK 1 - Reading & Writing</li>
                <li>UNLOCK 2 - Listening & Speaking</li>
                <li>English for Academic Purposes</li>
            </ul>
        `,
        image: "/newsPage/newsImages/EnglishBooks471.jpeg",
        date: "2025-08-24T14:34:00",
        author: "عبدالملك الخليفة",
        category: "الكتب"
    },
    {
        id: 2,
        title: "مواصفات الزي الموحد المحدثة لكليات ومعاهد الجبيل الصناعية",
        content: `
            <p>- موقع الشعار على الزي الرسمي:</p>
            <p>تتوسط الدائرة موضعها مع الحفاظ على مساحة آمنة تعادل حجم الشعار بداخل الدائرة ويكون إرتفاع الشعار داخل الدائرة يساوي 60% من قطر الدائرة مع الحفاظ على مسافة آمنة بين طرف الدائرة العلوي ونهاية انحناء الكتف كما يتموضع مسمى كلية الجبيل الصناعية ومعهد الجبيل التقني على بعد مسافة ارتفاعه أسفل الدائرة مع مراعاة مسافة آمنة جانبية لاستدارة الكم</p>
            <p>يمكن للطالب طلب الزي من خلال اي مزود بشرط الالتزام بالمواصفات الخاصة بالخامات والتصميم المعتمد</p>
        `,
        image: "/newsPage/newsImages/uniform.jpeg",
        date: "2025-08-25T17:15:00",
        author: "رائد الزهراني",
        category: "الزي الموحد"
    },
    {
        id: 3,
        title: "خريطة كلية الجبيل الصناعية",
        content: `
            <p>نموذج لخريطة الكلية فيه كل أسماء واختصارات المباني الللي ممكن تحتاجها</p>
            
        `,
        image: "/newsPage/newsImages/jicMap.png",
        date: "2025-08-26T13:42:00",
        author: "رائد الزهراني",
        category: "خريطة"
    },
    {
        id: 4,
        title: "يسر نادي الاستدامة أن يعلن عن فتح باب التسجيل للعام الجديد!",
        content: `
            <p>‎بعد نجاح عامنا الأول، نعود هذه السنة بفعاليات أكثر تنوعًا وتميزًا!</p>
            <p>ماذا ينتظرك هذا العام؟ ✨</p>
            <ul style="direction: rtl;">
                <li>ورش عمل تطوعية حول الاستدامة وحماية البيئة.</li>
                <li>فرص لتطوير مهاراتك في مجالات مبتكرة مثل الطاقة المتجددة والزراعة المستدامة.</li>
                <li>المشاركة في مشاريع بيئية رائدة وتحديات مليئة بالإبداع.</li>
                <li>التعرف على مسارات مهنية وبناء شبكة علاقات مع خبراء ومختصين.</li>
                <li>بيئة محفزة تدعم التعاون والأفكار الخلاقة بين الأعضاء.</li>
            </ul>
            <p style="direction: rtl;">قم بالتجيل عبر الرابط:</p>
            <a href="https://forms.gle/cWttjUv4aSMJ8b9cA">https://forms.gle/cWttjUv4aSMJ8b9cA</a>
            

        `,
        image: "/newsPage/newsImages/jicSustainabilityClub.jpeg",
        date: "2025-08-27T14:37:00",
        author: "",
        category: "نادي الإستدامة"
    },
    {
        id: 5,
        title: "دورة مهارات الإبتكار",
        content: `
            <p>‎بعد نجاح عامنا الأول، نعود هذه السنة بفعاليات أكثر تنوعًا وتميزًا!</p>
            <p>ماذا ينتظرك هذا العام؟ ✨</p>
            <ul style="direction: rtl;">
                <li>ورش عمل تطوعية حول الاستدامة وحماية البيئة.</li>
                <li>فرص لتطوير مهاراتك في مجالات مبتكرة مثل الطاقة المتجددة والزراعة المستدامة.</li>
                <li>المشاركة في مشاريع بيئية رائدة وتحديات مليئة بالإبداع.</li>
                <li>التعرف على مسارات مهنية وبناء شبكة علاقات مع خبراء ومختصين.</li>
                <li>بيئة محفزة تدعم التعاون والأفكار الخلاقة بين الأعضاء.</li>
            </ul>
            <p style="direction: rtl;">قم بالتجيل عبر الرابط:</p>
            <a href="https://forms.gle/cWttjUv4aSMJ8b9cA">https://forms.gle/cWttjUv4aSMJ8b9cA</a>
        `

    }
];

// دالة للحصول على خبر بواسطة ID
function getNewsArticleById(articleId) {
    return newsData.find(article => article.id === parseInt(articleId));
}

// دالة للحصول على جميع الأخبار
function getAllNewsArticles() {
    return newsData.sort((a, b) => new Date(b.date) - new Date(a.date));
}

